snlkuharlocal/src/Documents/УстановкаШКGS1/УстановкаШКGS1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаШКGS1</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидШк</name>
    <comment>Вид устанавливаемого ШК</comment>
    <type>
      <types>EnumRef.ВидыШК</types>
    </type>
  </attributes>
  <attributes>
    <name>Отработан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидШк</name>
      <comment>Вид устанавливаемого ШК</comment>
      <type>
        <types>EnumRef.ВидыШК</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипШк</name>
      <comment>Тип устанавливаемого ШК</comment>
      <type>
        <types>EnumRef.ТипыШтрихКодов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипыШК</name>
    <attributes>
      <name>ТипШК</name>
      <type>
        <types>EnumRef.ТипыШтрихКодов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/РезервированиеШКGS1/РезервированиеШКGS1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезервированиеШКGS1</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстановки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУстановки</name>
    <type>
      <types>DocumentRef.УстановкаШКGS1</types>
    </type>
  </attributes>
  <dimensions>
    <name>GS1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.РезервированиеШК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Присвоен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ФорматыШК/ФорматыШК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФорматыШК</name>
  <enumValues>
    <name>ITF14</name>
  </enumValues>
  <enumValues>
    <name>EAN13</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/ШтрихКоды/ШтрихКоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтрихКоды</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидШК</name>
    <type>
      <types>EnumRef.ВидыШК</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаМодификации</name>
    <type>
      <types>EnumRef.ПричиныКорректировкиШК</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтВКоробе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматШК</name>
    <type>
      <types>EnumRef.ФорматыШК</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКодGS1</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/Documents/УстановкаШКGS1/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	
	
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли; 
	
	НадоПерезаписыватьСкидки	= Ложь;
	ЕстьИзменения				= Модифицированность();
	//
	//Если НЕ ОбменДанными.Загрузка Тогда
	//	КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
	//	МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
	//	
	//	Если Отказ Тогда Возврат КонецЕсли; 	
	//КонецЕсли;		
	//
	//УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки

	ПараметрыСеанса.ЗапущенаОбработка = Истина;
	
	Ошибка = 0;
	
	Для каждого Текстрока из  товары цикл	
		
		Набор = РегистрыСведений.РезервированиеШКGS1.СоздатьНаборЗаписей();
		Набор.Отбор.GS1.Установить(Текстрока.ШК);
		Набор.Прочитать();
		Если Набор.Количество() Тогда
			Для каждого ТекТИпШК из ТипыШК цикл
				Запрос = Новый Запрос;
				Запрос.Текст="ВЫБРАТЬ
				|	ШтрихКоды.Ссылка КАК Ссылка,
				|	ШтрихКоды.Владелец КАК Владелец,
				|	ШтрихКоды.ТипШК КАК ТипШК,
				|	ШтрихКоды.ВидШК КАК ВидШК,
				|	ШтрихКоды.Наименование КАК Наименование
				|ИЗ
				|	Справочник.ШтрихКоды КАК ШтрихКоды
				|ГДЕ
				|	ШтрихКоды.Наименование = &текшк
				|	И ШтрихКоды.ТипШК = &типШк
				|	И ШтрихКоды.ВидШК = &видШк
				|	И ШтрихКоды.Владелец = &ном";
				Запрос.УстановитьПараметр("ТекШК",Строка(Текстрока.ШК));
				Запрос.УстановитьПараметр("ТипШК",ТекТипШК.типШК);
				Запрос.УстановитьПараметр("ВидШК",Текстрока.ВидШК);
				Запрос.УстановитьПараметр("Ном",Текстрока.Номенклатура);
				
				Рез = Запрос.Выполнить().Выбрать();
				Если рез.Следующий() тогда
					Если рез.ссылка.пометкаУдаления = ложь тогда
						продолжить;
					иначе
						шкОб = рез.Ссылка.получитьОбъект();
						ШкОб.пометкаудаления = ложь;
						ШкОб.записать();
						// сам регистр пометим на использование
						Запись = Набор[0];
						Запись.документУстановки = ЭтотОбъект.Ссылка;
						Запись.номенклатура = ТекСтрока.Номенклатура;
						Запись.датаустановки = текущаяДата();
						запись.присвоен = истина;
						Запись.автор = ЭтотОбъект.Автор; 
						Набор.Записать();
						
						
						продолжить;
					КонецЕсли;
				КонецЕсли;
				
				// создадим элемент справочника ШК НОМ.
				Попытка 
					НовШК = справочники.ШтрихКоды.СоздатьЭлемент();
					НовШК.ВидШК = ТекСТрока.видшк;
					НовШк.ТипШК = ТекТИпШк.типШК;
					НовШк.форматШК = перечисления.ФорматыШК.EAN13;
					
					НовШк.Владелец = текстрока.Номенклатура;
					НовШк.Наименование = Текстрока.ШК;
					НовШК.Описание =  "GS1";
					НовШК.Записать();
				Исключение
					Ошибка = 1;
					#если клиент тогда
						сообщить("Для строки "+Текстрока.НомерСтроки+" - не записан ШК. "+Текстрока.ШК+" Ошибка записи."+ОписаниеОшибки());
						
						сообщить("Проведение отменено");
					#конецесли
					
					отказ = истина;
				конецПопытки;
			конецЦикла;
			
			
			Если не Ошибка Тогда
				// сам регистр пометим на использование
				Запись = Набор[0];
				Запись.документУстановки = ЭтотОбъект.Ссылка;
				Запись.номенклатура = ТекСтрока.Номенклатура;
				Запись.датаустановки = текущаяДата();
				запись.присвоен = истина;
				Запись.автор = ЭтотОбъект.Автор; 
				Набор.Записать();
				
				//Отработан = истина;
				
			Иначе 
				прервать;
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	ПараметрыСеанса.ЗапущенаОбработка = Ложь;
	Если НЕ Отказ Тогда
		
		отработан = истина;
		ЭтотОбъект.Записать();
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	Для каждого Текстрока из  товары цикл	
		
		Набор = РегистрыСведений.РезервированиеШКGS1.СоздатьНаборЗаписей();
		Набор.Отбор.GS1.Установить(Текстрока.ШК);
		Набор.Прочитать();
		Если Набор.Количество() Тогда
			Для каждого ТекТИпШК из ТипыШК цикл
				
				Запрос = Новый Запрос;
				Запрос.Текст="ВЫБРАТЬ
				|	ШтрихКоды.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.ШтрихКоды КАК ШтрихКоды
				|ГДЕ
				|	ШтрихКоды.Наименование = &текшк
				|	И ШтрихКоды.ТипШК = &типШк
				|	И ШтрихКоды.ВидШК = &видШк
				|	И ШтрихКоды.Владелец = &ном";
				Запрос.УстановитьПараметр("ТекШК",Строка(Текстрока.ШК));
				Запрос.УстановитьПараметр("ТипШК",ТекТипШк.типШК);
				Запрос.УстановитьПараметр("ВидШК",Текстрока.ВидШК);
				Запрос.УстановитьПараметр("Ном",Текстрока.Номенклатура);
				
				Рез = Запрос.Выполнить().Выбрать();
				Если рез.Следующий() тогда
					Если рез.ссылка.пометкаУдаления = истина тогда
						продолжить;
					иначе
						шкОб = рез.Ссылка.получитьОбъект();
						ШкОб.пометкаудаления = истина;
						ШкОб.записать();
						
						Запись = Набор[0];
						Запись.документУстановки = ЭтотОбъект.Ссылка;
						Запись.номенклатура = ТекСтрока.Номенклатура;
						Запись.датаустановки = дата(1,1,1);
						запись.присвоен = ложь;
						Запись.автор = ЭтотОбъект.Автор; 
						Набор.Записать();
						
						
						
						продолжить;
					КонецЕсли;
				конецЕсли;
				
			конецЦикла;
			Ошибка = 0;
			
			Если не Ошибка Тогда
				// сам регистр пометим на использование
				Запись = Набор[0];
				Запись.документУстановки = ЭтотОбъект.Ссылка;
				Запись.номенклатура = ТекСтрока.Номенклатура;
				Запись.датаустановки = дата(1,1,1);
				запись.присвоен = ложь;
				Запись.автор = ЭтотОбъект.Автор; 
				Набор.Записать();
				
			Иначе 
				прервать;
			КонецЕсли;
			
			
			
			
		КонецЕсли;	
		
	КонецЦикла;
	
	
	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	
	Для каждого Текстрока из товары цикл
		
		Текстрока.ШК = "";
		
	КонецЦикла;
	
КонецПроцедуры
